sulaolab/nora-hal-dspic33ck-gpio/src/nora_pps_dspic33ck.c
/*
 * nora_pps_dspic33ck.c
 * ---------------
 * PPS routing implementation. See nora_pps.h for the layering and contract.
 * This is the CK sibling of dspic33ak_pps.c and follows the same structure:
 *   - output function code : _RPOUT_<sig>   (e.g. _RPOUT_SDO1)
 *   - output pin register  : _RP<nn>R       (RPORx bit-field alias)
 *   - input-select register: _<sig>R        (RPINRx bit-field alias)
 * A peripheral / RP the selected device header does not define is left out of
 * the relevant switch and the call returns false -- no per-device part-number
 * conditionals.
 */

#include "nora_pps.h"

#include <xc.h>
#include <stddef.h>
#include <stdint.h>

/* Physical remappable RP range on this classic-PPS device: ports B/C/D only. */
#define NORA_PPS_RP_MIN  32u
#define NORA_PPS_RP_MAX  79u

/* Virtual RP range (RPV0..RPV5). Padless; see the header. */
#define NORA_PPS_RPV_MIN 176u
#define NORA_PPS_RPV_MAX 181u


//===========================================================
// PPS lock gate (RPCON.IOLOCK)
//===========================================================
// Unlike dsPIC33A -- whose PAC leaves RPCON directly writable, so AK sets
// IOLOCK with a plain RPCONbits write -- the classic CK PPS block requires the
// __builtin_write_RPCON() unlock sequence to change IOLOCK. IOLOCK is bit 11
// (0x0800): write 0x0000 to unlock (IOLOCK = 0), 0x0800 to lock (IOLOCK = 1).
void nora_pps_unlock(void)
{
    __builtin_write_RPCON(0x0000);   /* IOLOCK = 0 : PPS writable  */
}

void nora_pps_lock(void)
{
    __builtin_write_RPCON(0x0800);   /* IOLOCK = 1 : PPS protected */
}


//===========================================================
// Local: peripheral output -> RPORx function code (_RPOUT_*)
//===========================================================
static bool nora_pps_get_output_code(nora_pps_output_t output, uint8_t *code)
{
    if (code == NULL)
    {
        return false;
    }

    switch (output)
    {
#ifdef _RPOUT_U1TX
    case NORA_PPS_OUTPUT_U1TX: *code = (uint8_t)_RPOUT_U1TX; return true;
#endif
#ifdef _RPOUT_U2TX
    case NORA_PPS_OUTPUT_U2TX: *code = (uint8_t)_RPOUT_U2TX; return true;
#endif
#ifdef _RPOUT_U3TX
    case NORA_PPS_OUTPUT_U3TX: *code = (uint8_t)_RPOUT_U3TX; return true;
#endif
#if defined(_RPOUT_SS1OUT)
    case NORA_PPS_OUTPUT_SS1:  *code = (uint8_t)_RPOUT_SS1OUT;  return true;
#elif defined(_RPOUT_SS1)
    // dsPIC33CK64MC105 (and siblings): same function, no OUT suffix.
    case NORA_PPS_OUTPUT_SS1:  *code = (uint8_t)_RPOUT_SS1;     return true;
#endif
#if defined(_RPOUT_SCK1OUT)
    case NORA_PPS_OUTPUT_SCK1: *code = (uint8_t)_RPOUT_SCK1OUT; return true;
#elif defined(_RPOUT_SCK1)
    case NORA_PPS_OUTPUT_SCK1: *code = (uint8_t)_RPOUT_SCK1;    return true;
#endif
#ifdef _RPOUT_SDO1
    case NORA_PPS_OUTPUT_SDO1: *code = (uint8_t)_RPOUT_SDO1; return true;
#endif
#if defined(_RPOUT_SS2OUT)
    case NORA_PPS_OUTPUT_SS2:  *code = (uint8_t)_RPOUT_SS2OUT;  return true;
#elif defined(_RPOUT_SS2)
    case NORA_PPS_OUTPUT_SS2:  *code = (uint8_t)_RPOUT_SS2;     return true;
#endif
#if defined(_RPOUT_SCK2OUT)
    case NORA_PPS_OUTPUT_SCK2: *code = (uint8_t)_RPOUT_SCK2OUT; return true;
#elif defined(_RPOUT_SCK2)
    case NORA_PPS_OUTPUT_SCK2: *code = (uint8_t)_RPOUT_SCK2;    return true;
#endif
#ifdef _RPOUT_SDO2
    case NORA_PPS_OUTPUT_SDO2: *code = (uint8_t)_RPOUT_SDO2; return true;
#endif
#ifdef _RPOUT_SS3OUT
    case NORA_PPS_OUTPUT_SS3:  *code = (uint8_t)_RPOUT_SS3OUT;  return true;
#endif
#ifdef _RPOUT_SCK3OUT
    case NORA_PPS_OUTPUT_SCK3: *code = (uint8_t)_RPOUT_SCK3OUT; return true;
#endif
#ifdef _RPOUT_SDO3
    case NORA_PPS_OUTPUT_SDO3: *code = (uint8_t)_RPOUT_SDO3; return true;
#endif
#if defined(_RPOUT_SS4OUT)
    case NORA_PPS_OUTPUT_SS4:  *code = (uint8_t)_RPOUT_SS4OUT;  return true;
#elif defined(_RPOUT_SS4)
    case NORA_PPS_OUTPUT_SS4:  *code = (uint8_t)_RPOUT_SS4;     return true;
#endif
#if defined(_RPOUT_SCK4OUT)
    case NORA_PPS_OUTPUT_SCK4: *code = (uint8_t)_RPOUT_SCK4OUT; return true;
#elif defined(_RPOUT_SCK4)
    case NORA_PPS_OUTPUT_SCK4: *code = (uint8_t)_RPOUT_SCK4;    return true;
#endif
#ifdef _RPOUT_SDO4
    case NORA_PPS_OUTPUT_SDO4: *code = (uint8_t)_RPOUT_SDO4; return true;
#endif
#ifdef _RPOUT_CLC1OUT
    case NORA_PPS_OUTPUT_CLC1: *code = (uint8_t)_RPOUT_CLC1OUT; return true;
#endif
#ifdef _RPOUT_CLC2OUT
    case NORA_PPS_OUTPUT_CLC2: *code = (uint8_t)_RPOUT_CLC2OUT; return true;
#endif
#ifdef _RPOUT_CLC3OUT
    case NORA_PPS_OUTPUT_CLC3: *code = (uint8_t)_RPOUT_CLC3OUT; return true;
#endif
#ifdef _RPOUT_CLC4OUT
    case NORA_PPS_OUTPUT_CLC4: *code = (uint8_t)_RPOUT_CLC4OUT; return true;
#endif
#ifdef _RPOUT_PWM4H
    case NORA_PPS_OUTPUT_PWM4H: *code = (uint8_t)_RPOUT_PWM4H; return true;
#endif
#ifdef _RPOUT_PWM4L
    case NORA_PPS_OUTPUT_PWM4L: *code = (uint8_t)_RPOUT_PWM4L; return true;
#endif
#ifdef _RPOUT_PWM1H
    case NORA_PPS_OUTPUT_PWM1H: *code = (uint8_t)_RPOUT_PWM1H; return true;
#endif
#ifdef _RPOUT_PWM2H
    case NORA_PPS_OUTPUT_PWM2H: *code = (uint8_t)_RPOUT_PWM2H; return true;
#endif
#ifdef _RPOUT_PWM3H
    case NORA_PPS_OUTPUT_PWM3H: *code = (uint8_t)_RPOUT_PWM3H; return true;
#endif
#ifdef _RPOUT_PWM5H
    case NORA_PPS_OUTPUT_PWM5H: *code = (uint8_t)_RPOUT_PWM5H; return true;
#endif
#ifdef _RPOUT_PWM5L
    case NORA_PPS_OUTPUT_PWM5L: *code = (uint8_t)_RPOUT_PWM5L; return true;
#endif
#ifdef _RPOUT_PWM6H
    case NORA_PPS_OUTPUT_PWM6H: *code = (uint8_t)_RPOUT_PWM6H; return true;
#endif
#ifdef _RPOUT_PWM6L
    case NORA_PPS_OUTPUT_PWM6L: *code = (uint8_t)_RPOUT_PWM6L; return true;
#endif
#ifdef _RPOUT_PWM7H
    case NORA_PPS_OUTPUT_PWM7H: *code = (uint8_t)_RPOUT_PWM7H; return true;
#endif
#ifdef _RPOUT_PWM7L
    case NORA_PPS_OUTPUT_PWM7L: *code = (uint8_t)_RPOUT_PWM7L; return true;
#endif
#ifdef _RPOUT_PWM8H
    case NORA_PPS_OUTPUT_PWM8H: *code = (uint8_t)_RPOUT_PWM8H; return true;
#endif
#ifdef _RPOUT_PWM8L
    case NORA_PPS_OUTPUT_PWM8L: *code = (uint8_t)_RPOUT_PWM8L; return true;
#endif
    /* PWM event outputs. CK silicon spells these PWMEA..PWMED; the neutral name
     * in nora_pps.h is the function, not either family's spelling. */
#ifdef _RPOUT_PWMEA
    case NORA_PPS_OUTPUT_PWM_EVENT_A: *code = (uint8_t)_RPOUT_PWMEA; return true;
#endif
#ifdef _RPOUT_PWMEB
    case NORA_PPS_OUTPUT_PWM_EVENT_B: *code = (uint8_t)_RPOUT_PWMEB; return true;
#endif
#ifdef _RPOUT_PWMEC
    case NORA_PPS_OUTPUT_PWM_EVENT_C: *code = (uint8_t)_RPOUT_PWMEC; return true;
#endif
#ifdef _RPOUT_PWMED
    case NORA_PPS_OUTPUT_PWM_EVENT_D: *code = (uint8_t)_RPOUT_PWMED; return true;
#endif
#ifdef _RPOUT_CMP1
    case NORA_PPS_OUTPUT_CMP1: *code = (uint8_t)_RPOUT_CMP1; return true;
#endif
#ifdef _RPOUT_CMP2
    case NORA_PPS_OUTPUT_CMP2: *code = (uint8_t)_RPOUT_CMP2; return true;
#endif
#ifdef _RPOUT_CMP3
    case NORA_PPS_OUTPUT_CMP3: *code = (uint8_t)_RPOUT_CMP3; return true;
#endif
    /* Reference clock output. CK256MP508 names it REFO1; CK64MC105 has ONE
     * reference clock and drops the digit (_RPOUT_REFO). Guarding only on
     * _RPOUT_REFO1 left this signal unroutable on MC105 -- silicon that has the
     * output, an enum value that names it, and a route call that returned false.
     * Same shape as the SS1OUT/SS1 pair above. */
#if defined(_RPOUT_REFO1)
    case NORA_PPS_OUTPUT_REFO1: *code = (uint8_t)_RPOUT_REFO1; return true;
#elif defined(_RPOUT_REFO)
    case NORA_PPS_OUTPUT_REFO1: *code = (uint8_t)_RPOUT_REFO;  return true;
#endif
#ifdef _RPOUT_REFO2
    case NORA_PPS_OUTPUT_REFO2: *code = (uint8_t)_RPOUT_REFO2; return true;
#endif
#ifdef _RPOUT_CAN1TX
    case NORA_PPS_OUTPUT_CAN1TX: *code = (uint8_t)_RPOUT_CAN1TX; return true;
#endif
#ifdef _RPOUT_CAN2TX
    case NORA_PPS_OUTPUT_CAN2TX: *code = (uint8_t)_RPOUT_CAN2TX; return true;
#endif
    /* CLC5..CLC10 exist on dsPIC33AK512MPS512, not on any CK part here; the
     * #ifdefs compile them out rather than needing a family split. */
#ifdef _RPOUT_CLC5OUT
    case NORA_PPS_OUTPUT_CLC5:  *code = (uint8_t)_RPOUT_CLC5OUT;  return true;
#endif
#ifdef _RPOUT_CLC6OUT
    case NORA_PPS_OUTPUT_CLC6:  *code = (uint8_t)_RPOUT_CLC6OUT;  return true;
#endif
#ifdef _RPOUT_CLC7OUT
    case NORA_PPS_OUTPUT_CLC7:  *code = (uint8_t)_RPOUT_CLC7OUT;  return true;
#endif
#ifdef _RPOUT_CLC8OUT
    case NORA_PPS_OUTPUT_CLC8:  *code = (uint8_t)_RPOUT_CLC8OUT;  return true;
#endif
#ifdef _RPOUT_CLC9OUT
    case NORA_PPS_OUTPUT_CLC9:  *code = (uint8_t)_RPOUT_CLC9OUT;  return true;
#endif
#ifdef _RPOUT_CLC10OUT
    case NORA_PPS_OUTPUT_CLC10: *code = (uint8_t)_RPOUT_CLC10OUT; return true;
#endif
#ifdef _RPOUT_CMP4
    case NORA_PPS_OUTPUT_CMP4: *code = (uint8_t)_RPOUT_CMP4; return true;
#endif
#ifdef _RPOUT_CMP5
    case NORA_PPS_OUTPUT_CMP5: *code = (uint8_t)_RPOUT_CMP5; return true;
#endif
#ifdef _RPOUT_CMP6
    case NORA_PPS_OUTPUT_CMP6: *code = (uint8_t)_RPOUT_CMP6; return true;
#endif
#ifdef _RPOUT_CMP7
    case NORA_PPS_OUTPUT_CMP7: *code = (uint8_t)_RPOUT_CMP7; return true;
#endif
#ifdef _RPOUT_CMP8
    case NORA_PPS_OUTPUT_CMP8: *code = (uint8_t)_RPOUT_CMP8; return true;
#endif
    default:
        break;
    }
    return false;   /* peripheral output not available on this device */
}


//===========================================================
// Local: write the output function code onto an RP pin's _RPnnR
//===========================================================
// _RPnnR is a bit-field alias (assignment only; no address / no formula). Every
// physical remappable RP on this device (RP32..RP79, ports B/C/D) is listed,
// each #ifdef-guarded so only the device's real registers compile. Ports A/E
// have no RPn; the RPV virtual outputs are excluded (this API is typed for
// physical GPIO RPs, matching the AK sibling). Flat switch by design -- a switch
// (not a formula) is the safe canonical form and mirrors dspic33ak_pps.c.
static bool nora_pps_write_output_rp(nora_gpio_rp_t rp, uint8_t code)
{
    switch (rp)
    {
#ifdef _RP32R
    case 32u: _RP32R = code; return true;
#endif
#ifdef _RP33R
    case 33u: _RP33R = code; return true;
#endif
#ifdef _RP34R
    case 34u: _RP34R = code; return true;
#endif
#ifdef _RP35R
    case 35u: _RP35R = code; return true;
#endif
#ifdef _RP36R
    case 36u: _RP36R = code; return true;
#endif
#ifdef _RP37R
    case 37u: _RP37R = code; return true;
#endif
#ifdef _RP38R
    case 38u: _RP38R = code; return true;
#endif
#ifdef _RP39R
    case 39u: _RP39R = code; return true;
#endif
#ifdef _RP40R
    case 40u: _RP40R = code; return true;
#endif
#ifdef _RP41R
    case 41u: _RP41R = code; return true;
#endif
#ifdef _RP42R
    case 42u: _RP42R = code; return true;
#endif
#ifdef _RP43R
    case 43u: _RP43R = code; return true;
#endif
#ifdef _RP44R
    case 44u: _RP44R = code; return true;
#endif
#ifdef _RP45R
    case 45u: _RP45R = code; return true;
#endif
#ifdef _RP46R
    case 46u: _RP46R = code; return true;
#endif
#ifdef _RP47R
    case 47u: _RP47R = code; return true;
#endif
#ifdef _RP48R
    case 48u: _RP48R = code; return true;
#endif
#ifdef _RP49R
    case 49u: _RP49R = code; return true;
#endif
#ifdef _RP50R
    case 50u: _RP50R = code; return true;
#endif
#ifdef _RP51R
    case 51u: _RP51R = code; return true;
#endif
#ifdef _RP52R
    case 52u: _RP52R = code; return true;
#endif
#ifdef _RP53R
    case 53u: _RP53R = code; return true;
#endif
#ifdef _RP54R
    case 54u: _RP54R = code; return true;
#endif
#ifdef _RP55R
    case 55u: _RP55R = code; return true;
#endif
#ifdef _RP56R
    case 56u: _RP56R = code; return true;
#endif
#ifdef _RP57R
    case 57u: _RP57R = code; return true;
#endif
#ifdef _RP58R
    case 58u: _RP58R = code; return true;
#endif
#ifdef _RP59R
    case 59u: _RP59R = code; return true;
#endif
#ifdef _RP60R
    case 60u: _RP60R = code; return true;
#endif
#ifdef _RP61R
    case 61u: _RP61R = code; return true;
#endif
#ifdef _RP62R
    case 62u: _RP62R = code; return true;
#endif
#ifdef _RP63R
    case 63u: _RP63R = code; return true;
#endif
#ifdef _RP64R
    case 64u: _RP64R = code; return true;
#endif
#ifdef _RP65R
    case 65u: _RP65R = code; return true;
#endif
#ifdef _RP66R
    case 66u: _RP66R = code; return true;
#endif
#ifdef _RP67R
    case 67u: _RP67R = code; return true;
#endif
#ifdef _RP68R
    case 68u: _RP68R = code; return true;
#endif
#ifdef _RP69R
    case 69u: _RP69R = code; return true;
#endif
#ifdef _RP70R
    case 70u: _RP70R = code; return true;
#endif
#ifdef _RP71R
    case 71u: _RP71R = code; return true;
#endif
#ifdef _RP72R
    case 72u: _RP72R = code; return true;
#endif
#ifdef _RP73R
    case 73u: _RP73R = code; return true;
#endif
#ifdef _RP74R
    case 74u: _RP74R = code; return true;
#endif
#ifdef _RP75R
    case 75u: _RP75R = code; return true;
#endif
#ifdef _RP76R
    case 76u: _RP76R = code; return true;
#endif
#ifdef _RP77R
    case 77u: _RP77R = code; return true;
#endif
#ifdef _RP78R
    case 78u: _RP78R = code; return true;
#endif
#ifdef _RP79R
    case 79u: _RP79R = code; return true;
#endif
    /* Virtual pins RPV0..RPV5 (RP176..RP181): padless on-chip routing endpoints.
     * Same _RPnnR aliases, same 6-bit code, so they belong in the same switch --
     * the only difference is that no GPIO configuration precedes them. */
#ifdef _RP176R
    case 176u: _RP176R = code; return true;
#endif
#ifdef _RP177R
    case 177u: _RP177R = code; return true;
#endif
#ifdef _RP178R
    case 178u: _RP178R = code; return true;
#endif
#ifdef _RP179R
    case 179u: _RP179R = code; return true;
#endif
#ifdef _RP180R
    case 180u: _RP180R = code; return true;
#endif
#ifdef _RP181R
    case 181u: _RP181R = code; return true;
#endif
    default:
        break;
    }
    return false;   /* no output PPS register for this RP on this device */
}


//===========================================================
// Local: read back an RP pin's _RPnnR output function code
//===========================================================
// Reading is the one direction that does NOT mirror the write switch's shape, and the
// reason is measured. _RPnnR is a readable bit-field alias, so a 48-case read switch is
// the obvious mirror -- but on CK64MC105/EV88G73A with --gc-sections on it cost 326
// bytes of flash (2026-08-03), because each case compiles to its own load/return and
// nothing can be discarded once find_output_rp() is referenced at all. A table sweep is
// a few instructions plus two bytes of const per pin.
//
// What keeps that safe is that the table is built from the SAME per-RP #ifdef list as
// the write switch: an entry exists only if that pin's register does, so the two cannot
// disagree about which pins the device has -- which is the point of centralising the map
// here instead of letting drivers keep private copies.
//
// Physical pins only: the reverse lookup answers "which pad", and including RPV0..5
// would let it report a padless pin as the answer.
#define NORA_PPS_RPOR_FIELD_MASK   (0x3Fu)   /* RPnR is a 6-bit output-select */
#define NORA_PPS_RPOR_FIELDS_PER   (2u)      /* two RPnR fields per 16-bit RPORx */

