sulaolab/nora-hal-dspic33ck-gpio/src/nora_pps_dspic33ck.c
/*
 * RPn -> (RPORx index, field position) for every PHYSICAL remappable pin this device
 * has. Position is affine in the SLOT, not in RPn -- and on CK64MC105 the pins are
 * non-contiguous above RP61, so slot != rp - 32 there. Encoding the slot explicitly
 * is what makes that safe: the value comes from the DFP header via _RPnnR_POSITION /
 * the RPORx the alias lives in, so there is no arithmetic to get wrong.
 */
typedef struct
{
    uint8_t rp;     /* the RP number                      */
    uint8_t slot;   /* index of its 6-bit field in the bank */
} nora_pps_rpor_entry_t;

static const nora_pps_rpor_entry_t s_pps_rpor[] = {
#define NORA_PPS_RPOR_ENTRY(n, s)  { (uint8_t)(n), (uint8_t)(s) },
#ifdef _RP32R
    NORA_PPS_RPOR_ENTRY(32u,  0u)
#endif
#ifdef _RP33R
    NORA_PPS_RPOR_ENTRY(33u,  1u)
#endif
#ifdef _RP34R
    NORA_PPS_RPOR_ENTRY(34u,  2u)
#endif
#ifdef _RP35R
    NORA_PPS_RPOR_ENTRY(35u,  3u)
#endif
#ifdef _RP36R
    NORA_PPS_RPOR_ENTRY(36u,  4u)
#endif
#ifdef _RP37R
    NORA_PPS_RPOR_ENTRY(37u,  5u)
#endif
#ifdef _RP38R
    NORA_PPS_RPOR_ENTRY(38u,  6u)
#endif
#ifdef _RP39R
    NORA_PPS_RPOR_ENTRY(39u,  7u)
#endif
#ifdef _RP40R
    NORA_PPS_RPOR_ENTRY(40u,  8u)
#endif
#ifdef _RP41R
    NORA_PPS_RPOR_ENTRY(41u,  9u)
#endif
#ifdef _RP42R
    NORA_PPS_RPOR_ENTRY(42u, 10u)
#endif
#ifdef _RP43R
    NORA_PPS_RPOR_ENTRY(43u, 11u)
#endif
#ifdef _RP44R
    NORA_PPS_RPOR_ENTRY(44u, 12u)
#endif
#ifdef _RP45R
    NORA_PPS_RPOR_ENTRY(45u, 13u)
#endif
#ifdef _RP46R
    NORA_PPS_RPOR_ENTRY(46u, 14u)
#endif
#ifdef _RP47R
    NORA_PPS_RPOR_ENTRY(47u, 15u)
#endif
#ifdef _RP48R
    NORA_PPS_RPOR_ENTRY(48u, 16u)
#endif
#ifdef _RP49R
    NORA_PPS_RPOR_ENTRY(49u, 17u)
#endif
#ifdef _RP50R
    NORA_PPS_RPOR_ENTRY(50u, 18u)
#endif
#ifdef _RP51R
    NORA_PPS_RPOR_ENTRY(51u, 19u)
#endif
#ifdef _RP52R
    NORA_PPS_RPOR_ENTRY(52u, 20u)
#endif
#ifdef _RP53R
    NORA_PPS_RPOR_ENTRY(53u, 21u)
#endif
#ifdef _RP54R
    NORA_PPS_RPOR_ENTRY(54u, 22u)
#endif
#ifdef _RP55R
    NORA_PPS_RPOR_ENTRY(55u, 23u)
#endif
#ifdef _RP56R
    NORA_PPS_RPOR_ENTRY(56u, 24u)
#endif
#ifdef _RP57R
    NORA_PPS_RPOR_ENTRY(57u, 25u)
#endif
#ifdef _RP58R
    NORA_PPS_RPOR_ENTRY(58u, 26u)
#endif
#ifdef _RP59R
    NORA_PPS_RPOR_ENTRY(59u, 27u)
#endif
#ifdef _RP60R
    NORA_PPS_RPOR_ENTRY(60u, 28u)
#endif
#ifdef _RP61R
    NORA_PPS_RPOR_ENTRY(61u, 29u)
#endif
    /* From here the two supported parts diverge: MP508 continues contiguously with
     * RP62.., while MC105 has no RP62..64 and resumes at RP65 in the NEXT slot. Each
     * entry states its own slot, so both descriptions are just data. */
#ifdef _RP62R
    NORA_PPS_RPOR_ENTRY(62u, 30u)
#endif
#ifdef _RP63R
    NORA_PPS_RPOR_ENTRY(63u, 31u)
#endif
#ifdef _RP64R
    NORA_PPS_RPOR_ENTRY(64u, 32u)
#endif
#if defined(_RP65R) && defined(_RP64R)
    NORA_PPS_RPOR_ENTRY(65u, 33u)   /* MP508: contiguous after RP64 */
#elif defined(_RP65R)
    NORA_PPS_RPOR_ENTRY(65u, 30u)   /* MC105: RPOR15 low field      */
#endif
#ifdef _RP66R
    NORA_PPS_RPOR_ENTRY(66u, 34u)
#endif
#ifdef _RP67R
    NORA_PPS_RPOR_ENTRY(67u, 35u)
#endif
#ifdef _RP68R
    NORA_PPS_RPOR_ENTRY(68u, 36u)
#endif
#ifdef _RP69R
    NORA_PPS_RPOR_ENTRY(69u, 37u)
#endif
#ifdef _RP70R
    NORA_PPS_RPOR_ENTRY(70u, 38u)
#endif
#ifdef _RP71R
    NORA_PPS_RPOR_ENTRY(71u, 39u)
#endif
#if defined(_RP72R) && defined(_RP71R)
    NORA_PPS_RPOR_ENTRY(72u, 40u)   /* MP508: contiguous            */
#elif defined(_RP72R)
    NORA_PPS_RPOR_ENTRY(72u, 31u)   /* MC105: RPOR15 high field     */
#endif
#ifdef _RP73R
    NORA_PPS_RPOR_ENTRY(73u, 41u)
#endif
#if defined(_RP74R) && defined(_RP73R)
    NORA_PPS_RPOR_ENTRY(74u, 42u)   /* MP508: contiguous            */
#elif defined(_RP74R)
    NORA_PPS_RPOR_ENTRY(74u, 32u)   /* MC105: RPOR16 low field      */
#endif
#ifdef _RP75R
    NORA_PPS_RPOR_ENTRY(75u, 43u)
#endif
#ifdef _RP76R
    NORA_PPS_RPOR_ENTRY(76u, 44u)
#endif
#if defined(_RP77R) && defined(_RP76R)
    NORA_PPS_RPOR_ENTRY(77u, 45u)   /* MP508: contiguous            */
#elif defined(_RP77R)
    NORA_PPS_RPOR_ENTRY(77u, 33u)   /* MC105: RPOR16 high field     */
#endif
#ifdef _RP78R
    NORA_PPS_RPOR_ENTRY(78u, 46u)
#endif
#ifdef _RP79R
    NORA_PPS_RPOR_ENTRY(79u, 47u)
#endif
#undef NORA_PPS_RPOR_ENTRY
};

#define NORA_PPS_RPOR_COUNT \
    (sizeof(s_pps_rpor) / sizeof(s_pps_rpor[0]))

/* Slot i lives in (&RPOR0)[i / 2], field (i odd) ? [13:8] : [5:0]. Affine in the
 * SLOT, which is exactly what the table above supplies. */
static uint8_t nora_pps_read_slot(uint8_t slot)
{
    const volatile uint16_t *reg = (&RPOR0) + (slot / NORA_PPS_RPOR_FIELDS_PER);
    const uint16_t           pos = ((slot & 1u) != 0u) ? 8u : 0u;

    return (uint8_t)((*reg >> pos) & NORA_PPS_RPOR_FIELD_MASK);
}


bool nora_pps_route_output(nora_pps_output_t output, nora_gpio_rp_t rp)
{
    uint8_t code;
    bool ok;

    if (!nora_pps_get_output_code(output, &code))
    {
        return false;
    }

    nora_pps_unlock();
    ok = nora_pps_write_output_rp(rp, code);
    nora_pps_lock();
    return ok;
}


bool nora_pps_find_output_rp(nora_pps_output_t output, nora_gpio_rp_t *rp)
{
    uint8_t want;
    uint32_t i;

    if (rp == NULL)
    {
        return false;
    }
    if (!nora_pps_get_output_code(output, &want))
    {
        return false;   /* peripheral output not available on this device */
    }

    /* Sweep the device's physical remappable pins in table order. The table contains
     * exactly the pins that exist, so there are no gaps to know about and no pin is
     * visited that has no register. Read-only (no IOLOCK), and only ever called at
     * bring-up -- no hot path. */
    for (i = 0u; i < (uint32_t)NORA_PPS_RPOR_COUNT; ++i)
    {
        if (nora_pps_read_slot(s_pps_rpor[i].slot) == want)
        {
            *rp = (nora_gpio_rp_t)s_pps_rpor[i].rp;
            return true;
        }
    }
    return false;   /* no physical pin currently carries this output */
}


bool nora_pps_route_input(nora_pps_input_t input, nora_gpio_rp_t rp)
{
    bool ok = true;

    /* Reject any RP that is neither a physical remappable pin nor a virtual one
     * before writing. RPINRx input-selects take the RP NUMBER, and the virtual
     * numbers are legal values there (that is how a padless output reaches another
     * peripheral's input) -- so the range check admits both bands and nothing
     * between or beyond them. */
    if (((rp < NORA_PPS_RP_MIN)  || (rp > NORA_PPS_RP_MAX)) &&
        ((rp < NORA_PPS_RPV_MIN) || (rp > NORA_PPS_RPV_MAX)))
    {
        return false;
    }

    nora_pps_unlock();

