sulaolab/nora-hal-dspic33ck-gpio/src/nora_pps_dspic33ck.c
    switch (input)
    {
#ifdef _U1RXR
    case NORA_PPS_INPUT_U1RX: _U1RXR = rp; break;
#endif
#ifdef _U2RXR
    case NORA_PPS_INPUT_U2RX: _U2RXR = rp; break;
#endif
#ifdef _U3RXR
    case NORA_PPS_INPUT_U3RX: _U3RXR = rp; break;
#endif
#ifdef _SS1R
    case NORA_PPS_INPUT_SS1:  _SS1R  = rp; break;
#endif
#ifdef _SCK1R
    case NORA_PPS_INPUT_SCK1: _SCK1R = rp; break;
#endif
#ifdef _SDI1R
    case NORA_PPS_INPUT_SDI1: _SDI1R = rp; break;
#endif
#ifdef _SS2R
    case NORA_PPS_INPUT_SS2:  _SS2R  = rp; break;
#endif
#ifdef _SCK2R
    case NORA_PPS_INPUT_SCK2: _SCK2R = rp; break;
#endif
#ifdef _SDI2R
    case NORA_PPS_INPUT_SDI2: _SDI2R = rp; break;
#endif
#ifdef _SS3R
    case NORA_PPS_INPUT_SS3:  _SS3R  = rp; break;
#endif
#ifdef _SCK3R
    case NORA_PPS_INPUT_SCK3: _SCK3R = rp; break;
#endif
#ifdef _SDI3R
    case NORA_PPS_INPUT_SDI3: _SDI3R = rp; break;
#endif
#ifdef _SS4R
    case NORA_PPS_INPUT_SS4:  _SS4R  = rp; break;
#endif
#ifdef _SCK4R
    case NORA_PPS_INPUT_SCK4: _SCK4R = rp; break;
#endif
#ifdef _SDI4R
    case NORA_PPS_INPUT_SDI4: _SDI4R = rp; break;
#endif
#ifdef _CLCINAR
    case NORA_PPS_INPUT_CLCINA: _CLCINAR = rp; break;
#endif
#ifdef _CLCINBR
    case NORA_PPS_INPUT_CLCINB: _CLCINBR = rp; break;
#endif
#ifdef _CLCINCR
    case NORA_PPS_INPUT_CLCINC: _CLCINCR = rp; break;
#endif
#ifdef _CLCINDR
    case NORA_PPS_INPUT_CLCIND: _CLCINDR = rp; break;
#endif
#ifdef _REFI1R
    case NORA_PPS_INPUT_REFI1: _REFI1R = rp; break;
#endif
#ifdef _INT1R
    case NORA_PPS_INPUT_INT1: _INT1R = rp; break;
#endif
#ifdef _INT2R
    case NORA_PPS_INPUT_INT2: _INT2R = rp; break;
#endif
#ifdef _INT3R
    case NORA_PPS_INPUT_INT3: _INT3R = rp; break;
#endif
#ifdef _CAN1RXR
    case NORA_PPS_INPUT_CAN1RX: _CAN1RXR = rp; break;
#endif
#ifdef _ICM1R
    case NORA_PPS_INPUT_ICM1: _ICM1R = rp; break;
#endif
#ifdef _ICM2R
    case NORA_PPS_INPUT_ICM2: _ICM2R = rp; break;
#endif
#ifdef _ICM3R
    case NORA_PPS_INPUT_ICM3: _ICM3R = rp; break;
#endif
#ifdef _ICM4R
    case NORA_PPS_INPUT_ICM4: _ICM4R = rp; break;
#endif
#ifdef _ICM5R
    case NORA_PPS_INPUT_ICM5: _ICM5R = rp; break;
#endif
#ifdef _ICM6R
    case NORA_PPS_INPUT_ICM6: _ICM6R = rp; break;
#endif
#ifdef _ICM7R
    case NORA_PPS_INPUT_ICM7: _ICM7R = rp; break;
#endif
#ifdef _ICM8R
    case NORA_PPS_INPUT_ICM8: _ICM8R = rp; break;
#endif
#ifdef _ICM9R
    case NORA_PPS_INPUT_ICM9: _ICM9R = rp; break;
#endif
    /* AK-side members of families already covered above. No CK part defines
     * _INT4R or _CLCINER..._CLCINJR, so these compile out here. */
#ifdef _INT4R
    case NORA_PPS_INPUT_INT4: _INT4R = rp; break;
#endif
#ifdef _CLCINER
    case NORA_PPS_INPUT_CLCINE: _CLCINER = rp; break;
#endif
#ifdef _CLCINFR
    case NORA_PPS_INPUT_CLCINF: _CLCINFR = rp; break;
#endif
#ifdef _CLCINGR
    case NORA_PPS_INPUT_CLCING: _CLCINGR = rp; break;
#endif
#ifdef _CLCINHR
    case NORA_PPS_INPUT_CLCINH: _CLCINHR = rp; break;
#endif
#ifdef _CLCINIR
    case NORA_PPS_INPUT_CLCINI: _CLCINIR = rp; break;
#endif
#ifdef _CLCINJR
    case NORA_PPS_INPUT_CLCINJ: _CLCINJR = rp; break;
#endif
#ifdef _REFI2R
    case NORA_PPS_INPUT_REFI2: _REFI2R = rp; break;
#endif
#ifdef _CAN2RXR
    case NORA_PPS_INPUT_CAN2RX: _CAN2RXR = rp; break;
#endif
    default:
        ok = false;   /* peripheral input not available on this device */
        break;
    }

    nora_pps_lock();
    return ok;
}


bool nora_pinmux_route_input(nora_pps_input_t function,
                                  nora_gpio_rp_t rp)
{
    if (!nora_gpio_rp_config_digital_input(rp))
    {
        return false;
    }

    return nora_pps_route_input(function, rp);
}


bool nora_pinmux_route_output(nora_pps_output_t function,
                                   nora_gpio_rp_t rp,
                                   bool initial_high)
{
    if (!nora_gpio_rp_config_digital_output(rp, initial_high))
    {
        return false;
    }

    return nora_pps_route_output(function, rp);
}
